on_pic = "https://graph.org/file/0c0de244f3e6ec807b1e1-ed1c6d566c78026fa2.jpg"
off_pic = "https://graph.org/file/35cb7e8e20d6d53a1ab42-efe99ac73e28437199.jpg"
files_cmd_pic = "https://telegra.ph/file/d44f46054250a73053614.jpg"
autodel_cmd_pic = "https://telegra.ph/file/a64533814021b40057ccd.jpg"

PICS = [
    "https://graph.org/file/02fb69b923afefd9ed8eb-9239c7fb4dbc16fc89.jpg",
    "https://graph.org/file/0c0de244f3e6ec807b1e1-ed1c6d566c78026fa2.jpg"
]

#PICS = #"https://telegra.ph/file/f3d3aff9ec422158feb05-d2180e3665e0ac4d32.jpg #https://envs.sh/8gs.jpg".split() #Required

START_PIC = "https://graph.org/file/3d47c9a6be2b68c9148d0-178c5f7955609c23f8.jpg"
FORCE_PIC = "https://graph.org/file/02fb69b923afefd9ed8eb-9239c7fb4dbc16fc89.jpg"


CUSTOM_CAPTION = "<b>» ʙʏ <a href=https://t.me/anime_mortals>Aɴɪᴍᴇ Mᴏʀᴛᴀʟs</a></b>"

#start message
START_MSG = """<b>›› ʜᴇʏ!!, {mention} ~

<blockquote>ʟᴏᴠᴇ ᴀɴɪᴍᴇs? ɪ ᴀᴍ ᴍᴀᴅᴇ ᴛᴏ ʜᴇʟᴘ ʏᴏᴜ ᴛᴏ ғɪɴᴅ ᴡʜᴀᴛ ʏᴏᴜ'ʀᴇ ʟᴏᴏᴋɪɴɢ ꜰᴏʀ. Bᴜᴛ I Sᴏʟᴇʟʏ Wᴏʀᴋ Fᴏʀ @HellFire_Academy_Official</blockquote></b>"""


#Force sub message 
FORCE_MSG =  """<b><blockquote>›› ʜᴇʏ {mention} ×</blockquote>\n  ʏᴏᴜʀ ғɪʟᴇ ɪs ʀᴇᴀᴅʏ ‼️ ʟᴏᴏᴋs ʟɪᴋᴇ ʏᴏᴜ ʜᴀᴠᴇɴ'ᴛ sᴜʙsᴄʀɪʙᴇᴅ ᴛᴏ ᴏᴜʀ ᴄʜᴀɴɴᴇʟs ʏᴇᴛ, sᴜʙsᴄʀɪʙᴇ ɴᴏᴡ ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ғɪʟᴇs</b>"""


CMD_TXT = """<b>» ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs:

<b>›› /batch :</b> ᴄʀᴇᴀᴛᴇ ɢʀᴏᴜᴘ ᴍᴇssᴀɢᴇs
<b>›› /genlink :</b> ᴄʀᴇᴀᴛᴇ ʟɪɴᴋ ғᴏʀ ᴏɴᴇ ᴘᴏsᴛ
<b>›› /broadcast :</b> ʙʀᴏᴀᴅᴄᴀsᴛ ᴍᴇssᴀɢᴇ
<b>›› /broadcast silent:</b> sɪʟᴇɴᴛ ʙʀᴏᴀᴅᴄᴀsᴛ ᴍᴇssᴀɢᴇ
<b>›› /autodel :</b> ᴠɪᴇᴡ ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ sᴇᴛᴛɪɴɢs 
<b>›› /restart :</b> ғᴏʀᴄᴇғᴜʟʟʏ ʀᴇsᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ (ᴏᴡɴᴇʀ)
<b>›› /status :</b> ᴠɪᴇᴡ ʙᴏᴛ sᴛᴀᴛɪsᴛɪᴄs + ᴜᴘᴛɪᴍᴇ"""

BAN_TXT = "<b><blockquote>Sᴏʀʀʏ, ʏᴏᴜ ᴀʀᴇ ʙᴀɴɴᴇᴅ</blockquote></b>"

CHANNELS_TXT = """<b>›› Aɴɪᴍᴇ Cʜᴀɴɴᴇʟ: <a href='https://t.me/anime_Raven'>Aɴɪᴍᴇ ʀᴀᴠᴇɴ</a>
<blockquote expandable>›› Oɴɢᴏɪɴɢ Cʜᴀɴɴᴇʟ: <a href='https://t.me/+2rkhpTrrb_cxMzA1'>Oɴɢᴏɪɴɢ ʀᴀᴠᴇɴ</a>
›› Iɴᴅᴇx Cʜᴀɴɴᴇʟ: <a href='https://t.me/anime_Raven_index'>Aɴɪᴍᴇ ʀᴀᴠᴇɴ</a></a>
›› ᴄᴏᴍᴍᴜɴɪᴛʏ: <a href='https://t.me/battousai_network'>ʙᴀᴛᴛᴏᴜsᴀɪ</a>
›› Dᴇᴠᴇʟᴏᴘᴇʀ: <a href='https://t.me/urr_sanjiii'>𝐒ᴀɴᴊɪ 𝐒aᴍᴀ</a></b></blockquote>"""

HELP_TEXT = """<b>⁉️ Hᴇʟʟᴏ {mention} ~

<blockquote expandable>➪ I ᴀᴍ ᴀ ᴘʀɪᴠᴀᴛᴇ ғɪʟᴇ sʜᴀʀɪɴɢ ʙᴏᴛ, ᴍᴇᴀɴᴛ ᴛᴏ ᴘʀᴏᴠɪᴅᴇ ғɪʟᴇs ᴀɴᴅ ɴᴇᴄᴇssᴀʀʏ sᴛᴜғғ ᴛʜʀᴏᴜɢʜ sᴘᴇᴄɪᴀʟ ʟɪɴᴋ ғᴏʀ sᴘᴇᴄɪғɪᴄ ᴄʜᴀɴɴᴇʟs.

➪ Iɴ ᴏʀᴅᴇʀ ᴛᴏ ɢᴇᴛ ᴛʜᴇ ғɪʟᴇs ʏᴏᴜ ʜᴀᴠᴇ ᴛᴏ ᴊᴏɪɴ ᴛʜᴇ ᴀʟʟ ᴍᴇɴᴛɪᴏɴᴇᴅ ᴄʜᴀɴɴᴇʟ ᴛʜᴀᴛ ɪ ᴘʀᴏᴠɪᴅᴇ ʏᴏᴜ ᴛᴏ ᴊᴏɪɴ. Yᴏᴜ ᴄᴀɴ ɴᴏᴛ ᴀᴄᴄᴇss ᴏʀ ɢᴇᴛ ᴛʜᴇ ғɪʟᴇs ᴜɴʟᴇss ʏᴏᴜ ᴊᴏɪɴᴇᴅ ᴀʟʟ ᴄʜᴀɴɴᴇʟs.

➪ Sᴏ ᴊᴏɪɴ Mᴇɴᴛɪᴏɴᴇᴅ Cʜᴀɴɴᴇʟs ᴛᴏ ɢᴇᴛ Fɪʟᴇs ᴏʀ ɪɴɪᴛɪᴀᴛᴇ ᴍᴇssᴀɢᴇs...

‣ /help -</b> Oᴘᴇɴ ᴛʜɪs ʜᴇʟᴘ ᴍᴇssᴀɢᴇ !</blockquote>
<b><i>◈ Sᴛɪʟʟ ʜᴀᴠᴇ ᴅᴏᴜʙᴛs, ᴄᴏɴᴛᴀᴄᴛ ʙᴇʟᴏᴡ ᴘᴇʀsᴏɴs/ɢʀᴏᴜᴘ ᴀs ᴘᴇʀ ʏᴏᴜʀ ɴᴇᴇᴅ !</i></b>"""

ABOUT_TXT = """<b>›› ᴍʏ ɴᴀᴍᴇ: {botname}
<blockquote expandable>›› ᴜᴘᴅᴀᴛᴇs ᴄʜᴀɴɴᴇʟ: <a href='https://t.me/HellFire_Academy'>𝐀ɴɪᴍᴇ</a>
›› ᴅᴇᴠᴇʟᴏᴘᴇʀ: <a href='https://t.me/Urr_Sanjiii'>𝐒ᴀɴᴊɪ</a></b></blockquote>"""

SETTING_TXT = """<b>»  Cᴏɴғɪɢᴜʀᴀᴛɪᴏɴs</b>
<blockquote expandable>» ᴛᴏᴛᴀʟ ғᴏʀᴄᴇ sᴜʙ ᴄʜᴀɴɴᴇʟ:  <b>{total_fsub}</b>
» ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ᴍᴏᴅᴇ:  <b>{autodel_mode}</b>
» ᴘʀᴏᴛᴇᴄᴛ ᴄᴏɴᴛᴇɴᴛ:  <b>{protect_content}</b>
» ʜɪᴅᴇ ᴄᴀᴘᴛɪᴏɴ:  <b>{hide_caption}</b>
» ᴄʜᴀɴɴᴇʟ ʙᴜᴛᴛᴏɴ:  <b>{chnl_butn}</b>
» ʀᴇǫᴜᴇsᴛ ғsᴜʙ ᴍᴏᴅᴇ: <b>{reqfsub}</b></blockquote>"""

CHANNELS_TXT = """<b>›› 𝐀ɴɪᴍᴇ 𝐂ʜᴀɴɴᴇʟ: <a href='https://t.me/HellFire_Academy_Official'>𝐀ɴɪᴍᴇ</a>
<blockquote expandable>›› 𝐎ɴɢᴏɪɴɢ 𝐂ʜᴀɴɴᴇʟ: <a href='https://t.me/ongoing_Hellfire_academy'>Oɴɢᴏɪɴɢ</a>
›› 18+ 𝐂ʜᴀɴɴᴇʟ: <a href='https://t.me/adult_flux'>Adult Flux</a>
›› 𝐍ᴇᴛᴡᴏʀᴋ: <a href='https://t.me/mugiwaras_network'>Mugiwaras</a>
›› Dᴇᴠᴇʟᴏᴘᴇʀ: <a href='https://t.me/Urr_Sanjiii'>𝗚𝗢𝗝𝗢</a></b></blockquote>"""

on_txt, off_txt = "Eɴᴀʙʟᴇᴅ ✅", "Dɪsᴀʙʟᴇᴅ ❌"

FILES_CMD_TXT ="""<b>ғɪʟᴇs ʀᴇʟᴀᴛᴇᴅ sᴇᴛᴛɪɴɢs:

<blockquote expandable>›› ᴘʀᴏᴛᴇᴄᴛ ᴄᴏɴᴛᴇɴᴛ: {protect_content}
›› ʜɪᴅᴇ ᴄᴀᴘᴛɪᴏɴ: {hide_caption}
›› ᴄʜᴀɴɴᴇʟ ʙᴜᴛᴛᴏɴ: {channel_button}</b>

›› ʙᴜᴛᴛᴏɴ Nᴀᴍᴇ: {name}
›› ʙᴜᴛᴛᴏɴ Lɪɴᴋ: {link}</blockquote>

<b>ᴄʟɪᴄᴋ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴs ᴛᴏ ᴄʜᴀɴɢᴇ sᴇᴛᴛɪɴɢs</b>"""

AUTODEL_CMD_TXT = """<b>» ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ sᴇᴛᴛɪɴɢs

<blockquote>›› ᴀᴜᴛᴏ ᴅᴇʟᴇᴛᴇ ᴍᴏᴅᴇ: {autodel_mode}</blockquote>
<blockquote>›› ᴅᴇʟᴇᴛᴇ ᴛɪᴍᴇʀ: {timer}</blockquote>

ᴄʟɪᴄᴋ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴs ᴛᴏ ᴄʜᴀɴɢᴇ sᴇᴛᴛɪɴɢs</b>"""

FSUB_CMD_TXT = """<b>» ғᴏʀᴄᴇ sᴜʙ ᴄᴏᴍᴍᴀɴᴅs :</b>

<b>›› /channels</b> : ᴄʜᴇᴄᴋ ᴄᴜʀʀᴇɴᴛ ғᴏʀᴄᴇ-sᴜʙ ᴄʜᴀɴɴᴇʟs (ᴀᴅᴍɪɴs)
<b>›› /addfsub</b> : ᴀᴅᴅ ᴏɴᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ғᴏʀᴄᴇ sᴜʙ ᴄʜᴀɴɴᴇʟs (ᴏᴡɴᴇʀ)
<b>›› /delfsub</b> : ᴅᴇʟᴇᴛᴇ ᴏɴᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ғᴏʀᴄᴇ sᴜʙ ᴄʜᴀɴɴᴇʟs (ᴏᴡɴᴇʀ)
<b>›› /req</b> : ʀᴇǫᴜᴇsᴛ ғsᴜʙ ᴍᴏᴅᴇ (ᴏᴡɴᴇʀ)"""


USER_CMD_TXT = """<b>» ᴀᴅᴍɪɴ ᴄᴏᴍᴍᴀɴᴅs: </b>
    
<b>/admins</b> : ᴠɪᴇᴡ ᴛʜᴇ ᴀᴠᴀɪʟᴀʙʟᴇ ᴀᴅᴍɪɴ ʟɪsᴛ (ᴏᴡɴᴇʀ)
<b>/addadmin</b> : ᴀᴅᴅ ᴏɴᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ᴜsᴇʀ ɪᴅs ᴀs ᴀᴅᴍɪɴ (ᴏᴡɴᴇʀ)
<b>/deladmin</b> : ᴅᴇʟᴇᴛᴇ ᴏɴᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ᴜsᴇʀ ɪᴅs ғʀᴏᴍ ᴀᴅᴍɪɴs (ᴏᴡɴᴇʀ)

<b>» ʙᴀɴ-ᴜɴʙᴀɴ ᴜsᴇʀ</b>
<b>/banlist</b> : ᴠɪᴇᴡ ᴛʜᴇ ᴀᴠᴀɪʟᴀʙʟᴇ ʙᴀɴɴᴇᴅ ᴜsᴇʀ ʟɪsᴛ (ᴏᴡɴᴇʀ)
<b>/ban</b> : ᴀᴅᴅ ᴏɴᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ᴜsᴇʀ ɪᴅs ɪɴ ʙᴀɴɴᴇᴅ ʟɪsᴛ (ᴏᴡɴᴇʀ)
<b>/unban</b> : ᴅᴇʟᴇᴛᴇ ᴏɴᴇ ᴏʀ ᴍᴜʟᴛɪᴘʟᴇ ᴜsᴇʀ ɪᴅs ғʀᴏᴍ ʙᴀɴɴᴇᴅ ʟɪsᴛ (ᴏᴡɴᴇʀ)"""



RFSUB_CMD_TXT = """<b>›› ʀᴇǫᴜᴇsᴛ ғsᴜʙ sᴇᴛᴛɪɴɢs:

<blockquote><b>» ʀᴇǫᴜᴇsᴛ ғsᴜʙ ᴍᴏᴅᴇ: {req_mode}</b></blockquote>

ᴄʟɪᴄᴋ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴs ᴛᴏ ᴄʜᴀɴɢᴇ sᴇᴛᴛɪɴɢs</b>"""


RFSUB_MS_TXT = """<b>›› ʀᴇǫᴜᴇsᴛ ғsᴜʙ ʟɪsᴛ:

<blockquote expandable>{reqfsub_list}</blockquote>
ᴄʟɪᴄᴋ ʙᴇʟᴏᴡ ʙᴜᴛᴛᴏɴs ᴛᴏ ᴄʜᴀɴɢᴇ sᴇᴛᴛɪɴɢs</b>"""

CLEAR_USERS_TXT = """<blockquote expandable><b>What is the use of Clear Users !?</b>

➪ Cʟᴇᴀʀ Usᴇʀs ɪs ᴜsᴇᴅ ᴛᴏ ᴄʟᴇᴀʀ ᴛʜᴇ ᴀʟʟ ᴜsᴇʀ ᴅᴀᴛᴀ ᴏғ ᴀ sᴘᴇᴄɪғɪᴇᴅ Rᴇǫᴜᴇsᴛ ғᴏʀᴄᴇsᴜʙ cʜᴀɴɴᴇʟ ɪᴅ. 

➪ Hᴇʀᴇ oɴʟʏ usᴇʀ ᴅᴀᴛᴀ ɪs ᴅᴇʟᴇᴛᴇᴅ ғʀᴏᴍ sᴘᴇᴄɪғɪᴇᴅ ᴄʜᴀɴɴᴇʟ.</blockquote>

<b><i>Cʜᴏᴏsᴇ ᴛʜᴇ Cʜᴀɴɴᴇʟ ɪᴅ ғᴏʀ ᴅᴇʟᴇᴛɪɴɢ ᴜsᴇʀ ᴅᴀᴛᴀ:</i></b>"""


CLEAR_CHNLS_TXT = """<blockquote expandable><b>What is the use of Clear Channels !?</b>

➪ Cʟᴇᴀʀ Cʜᴀɴɴᴇʟs ᴜsᴇᴅ ᴛᴏ Dᴇʟᴇᴛᴇ ᴀʟʟ ᴜsᴇʀ ᴅᴀᴛᴀ ᴀʟᴏɴɢ ᴡɪᴛʜ Rᴇǫᴜᴇsᴛ ғᴏʀᴄᴇsᴜʙ ᴄʜᴀɴɴᴇʟ ɪᴅ ᴀɴᴅ ʟɪɴᴋ ғʀᴏᴍ ᴅᴀᴛᴀʙᴀsᴇ. 

➪ Hᴇʀᴇ ᴀʟʟ ᴅᴀᴛᴀ ʀᴇᴀʟᴛᴇᴅ ᴛᴏ ʀᴇǫᴜᴇsᴛ ғᴏʀᴄᴇsᴜʙ ᴄʜᴀɴɴᴇʟ ɪᴅ ᴅᴇʟᴇᴛᴇᴅ Pᴇʀᴍᴀɴᴇɴᴛʟʏ...

<b>⚠️ WARNING:</b> Cʟᴇᴀʀ ᴛʜᴇ ᴄʜᴀɴɴᴇʟ ᴅᴀᴛᴀ ᴏɴʟʏ ᴡʜᴇɴ ɪᴛ ɪs ᴄᴏɴғɪʀᴍᴇᴅ ᴛʜᴀᴛ ᴛʜᴇ ᴅᴀᴛᴀ ᴡɪʟʟ ɴᴏ ʟᴏɴɢᴇʀ ʙᴇ ʀᴇǫᴜɪʀᴇᴅ ғᴏʀ ғᴜᴛᴜʀᴇ ᴏᴘᴇʀᴀᴛɪᴏɴs.</blockquote>

<b><i>Cʜᴏᴏsᴇ ᴛʜᴇ Cʜᴀɴɴᴇʟ ɪᴅ ғᴏʀ ᴅᴇʟᴇᴛɪɴɢ:</i></b>"""


CLEAR_LINKS_TXT = """<blockquote expandable><b>What is the use of Clear Links !?</b>

➪ Cʟᴇᴀʀ Sᴛᴏʀᴇᴅ Rᴇǫᴜᴇsᴛ Lɪɴᴋs ᴜsᴇᴅ ᴛᴏ Dᴇʟᴇᴛᴇ Lɪɴᴋs ᴏғ ᴀ sᴘᴇᴄɪғɪᴇᴅ ᴄʜᴀɴɴᴇʟ ɪɴ ᴅᴀᴛᴀʙᴀsᴇ ᴀs ᴡᴇʟʟ ᴀs ʀᴇᴠᴏᴋᴇ ᴛʜᴇ ʟɪɴᴋ ғʀᴏᴍ ᴛʜᴀᴛ Cʜᴀɴɴᴇʟ. 

➪ Eᴠᴇɴ ɪғ ᴄʟᴇᴀʀɪɴɢ ᴄʜᴀɴɴᴇʟ ᴅᴀᴛᴀ ᴛʜᴇ Rᴇǫᴜᴇsᴛ Lɪɴᴋ sᴛᴏʀᴇᴅ ᴏɴ ᴅᴀᴛᴀʙᴀsᴇ ғᴏʀ ғᴜᴛᴜʀᴇ ᴜsɪɴɢ ᴏғ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ, 

➪ Bʏ ᴅᴇʟᴇᴛɪɴɢ ʀᴇǫᴜᴇsᴛ ʟɪɴᴋ ᴏғ sᴘᴇᴄɪғɪᴇᴅ ᴄʜᴀɴɴᴇʟ ᴛʜᴇ ʟɪɴᴋ ᴡɪʟʟ ʙᴇ ʀᴇᴠᴏᴋᴇᴅ ғʀᴏᴍ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴀɴᴅ ɴᴏᴛ ᴜsᴀʙʟᴇ ᴀɴʏ ᴍᴏʀᴇ, 

➪ Sᴏ ᴛʜᴇ ʙᴏᴛ ᴡɪʟʟ ʜᴀᴠᴇ ᴛᴏ ᴄʀᴇᴀᴛᴇ ᴀɢᴀɪɴ ʀᴇǫᴜᴇsᴛ ʟɪɴᴋ ᴏғ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ɪɴ ғᴜᴛᴜʀᴇ ɪғ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴀɢᴀɪɴ ᴀᴅᴅᴇᴅ ᴀs ʀᴇǫᴜᴇsᴛ ғᴏʀᴄᴇsᴜʙ ᴄʜᴀɴɴᴇʟ.

<b>⚠️ NOTE:</b> 
‣ Tᴏ ᴘᴇʀғᴏʀᴍ ᴛʜɪs ᴀᴄᴛɪᴏɴ ᴛʜᴇ ʙᴏᴛ sʜᴏᴜʟᴅ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴀʟᴏɴɢ ᴡɪᴛʜ ᴘʀᴏᴘᴇʀ ᴘᴇʀᴍɪssɪᴏɴ ᴏɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ. 

‣ ɪғ ᴛʜᴇ ʙᴏᴛ ɴᴏᴛ ɪɴ ᴛʜᴀᴛ ᴄʜᴀɴɴᴇʟ ᴏʀ ᴅᴏɴ'ᴛ ʜᴀᴠᴇ ᴀᴅᴍɪɴ ᴘᴇʀᴍɪssɪᴏɴ ᴛʜᴇɴ ᴛʜɪs ᴏᴘᴇʀᴀᴛɪᴏɴ ᴄᴀɴ'ᴛ ʙᴇ ᴘᴇʀғᴏʀᴍᴇᴅ.</blockquote>

<b><i>Cʜᴏᴏsᴇ ᴛʜᴇ Cʜᴀɴɴᴇʟ ɪᴅ ғᴏʀ ᴅᴇʟᴇᴛɪɴɢ Rᴇǫᴜᴇsᴛ Lɪɴᴋ:</i></b>"""
